<center><a href='https://www.darshan.ac.in/'> <img src='https://www.darshan.ac.in/Content/media/DU_Logo.svg' width="250" height="300"/></a></center>
<pre>
<center><b><h1>Data Mining</b></center>
<center><b><h1>Gohel Neel</b></center>
<center><b><h3>Enrollnment No. : 23010101089</b></center>
<center><b><h3>Date: 06-06-2025</b></center>
<center><b><h1>Lab - 1</b></center>  
<pre>

# Introduction to Pandas Library Function:

# Step-1 Import the pandas Libraries

In [2]:
import pandas as pd

# Step-2 Import the dataset from this:....

# Step-3 Read csv or excel File

In [3]:
df = pd.read_csv('titanic.csv')

# Step-4 Print Data from csv or excel File

In [ ]:
df

# Step-5 See the First 10 Rows

In [5]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

# Step-6 See the Last 10 Rows

In [ ]:
df.tail(10)

# Step-7 Data type of each columns

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# Step-8 Display Summary Information

In [ ]:
df.info()

# Step-9 Access a specific column

In [ ]:
df['Age']

# Step-10 Access rows by their integer location

In [10]:
df.iloc[331]

PassengerId                    332
Survived                         0
Pclass                           1
Name           Partner, Mr. Austen
Sex                           male
Age                           45.5
SibSp                            0
Parch                            0
Ticket                      113043
Fare                          28.5
Cabin                         C124
Embarked                         S
Name: 331, dtype: object

# Step-11 Delete a specific Column

In [ ]:
df.drop('Age',axis=1)

In [ ]:
#delete row
df.drop(2)

# Step-12  Create a new Column

In [ ]:
df['Amount'] = df['Fare'] * 10
df

# Step-13  Perform Condition Selection on DataFrame

In [14]:
df.query('Amount>10 & Amount<50')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amount
378,379,0,3,"Betros, Mr. Tannous",male,20.0,0,0,2648,4.0125,NaN,C,40.125

# Step-14 Compute the sum of value

In [15]:
df['Amount'].sum()

np.float64(286939.493)

# Step-15 Compute the mean of value

In [16]:
df['Amount'].mean()

np.float64(322.0420796857464)

# Step-16 Count non-null value (column)

In [ ]:
df.isnull().sum()

# Step-17 Find Minimun or Maximum values

In [18]:
df['Amount'].min()

np.float64(0.0)

In [19]:
df['Amount'].max()

np.float64(5123.292)